; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v5 ?v9)
             (pred_8 ?v12 ?v1)
             (pred_3 ?v5 ?v1)
             (pred_2 ?v6 ?v5 )
	     (pred_4 ?v5)
             (pred_12 ?v3)
             (pred_7 ?v12)
             (pred_5 ?v1)
             (pred_10 ?v5)
             (pred_6 ?v12)
             (pred_9 ?v5)
             (pred_11 ))



(:action op_2
:parameters (?v4 ?v2 ?v10 ?v7)
:precondition (and (pred_12 ?v4) (pred_12 ?v2) (pred_7 ?v10) (pred_5 ?v7)
          (pred_1 ?v4 ?v2) (pred_8 ?v10 ?v7)
                   (pred_3 ?v2 ?v7) (pred_4 ?v4) 
                   (pred_10 ?v2) (pred_6 ?v10))
:effect (and  (pred_9 ?v2) (not (pred_10 ?v2))))


(:action op_1
:parameters (?v4 ?v13)
:precondition (and (pred_12 ?v4) (pred_12 ?v13)
               (pred_4 ?v4) (pred_1 ?v4 ?v13) (pred_9 ?v13))
:effect (and (pred_4 ?v13) (not (pred_4 ?v4))))

(:action op_3
:parameters (?v4 ?v10)
:precondition (and (pred_12 ?v4) (pred_7 ?v10) 
                  (pred_4 ?v4) (pred_2 ?v10 ?v4) (pred_11 ))
:effect (and (pred_6 ?v10)
   (not (pred_2 ?v10 ?v4)) (not (pred_11 ))))


(:action op_4
:parameters (?v4 ?v8 ?v11)
:precondition (and (pred_12 ?v4) (pred_7 ?v8) (pred_7 ?v11)
                  (pred_4 ?v4) (pred_6 ?v11) (pred_2 ?v8 ?v4))
:effect (and (pred_6 ?v8) (pred_2 ?v11 ?v4)
        (not (pred_6 ?v11)) (not (pred_2 ?v8 ?v4))))

(:action op_5
:parameters (?v4 ?v10)
:precondition (and (pred_12 ?v4) (pred_7 ?v10) 
                  (pred_4 ?v4) (pred_6 ?v10))
:effect (and (pred_11 ) (pred_2 ?v10 ?v4) (not (pred_6 ?v10)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_10 obj_08 obj_16 obj_11 obj_15 obj_14 obj_07 obj_18 obj_02 obj_13 obj_04 obj_19 obj_09 obj_22 obj_06 obj_05
    obj_21 obj_17 obj_12
    obj_20 obj_01 obj_03
    )

    (:init
       (pred_11)

       (pred_12 obj_10)
       (pred_12 obj_08)
       (pred_12 obj_16)
       (pred_12 obj_11)
       (pred_12 obj_15)
       (pred_12 obj_14)
       (pred_12 obj_07)
       (pred_12 obj_18)
       (pred_12 obj_02)
       (pred_12 obj_13)
       (pred_12 obj_04)
       (pred_12 obj_19)
       (pred_12 obj_09)
       (pred_12 obj_22)
       (pred_12 obj_06)
       (pred_12 obj_05)
       (pred_5 obj_21)
       (pred_5 obj_17)
       (pred_5 obj_12)
       (pred_7 obj_20)
       (pred_7 obj_01)
       (pred_7 obj_03)

       (pred_1 obj_10 obj_15)
       (pred_1 obj_10 obj_08)
       (pred_1 obj_08 obj_14)
       (pred_1 obj_08 obj_16)
       (pred_1 obj_08 obj_10)
       (pred_1 obj_16 obj_07)
       (pred_1 obj_16 obj_11)
       (pred_1 obj_16 obj_08)
       (pred_1 obj_11 obj_18)
       (pred_1 obj_11 obj_16)
       (pred_1 obj_15 obj_02)
       (pred_1 obj_15 obj_14)
       (pred_1 obj_15 obj_10)
       (pred_1 obj_14 obj_13)
       (pred_1 obj_14 obj_07)
       (pred_1 obj_14 obj_08)
       (pred_1 obj_14 obj_15)
       (pred_1 obj_07 obj_04)
       (pred_1 obj_07 obj_18)
       (pred_1 obj_07 obj_16)
       (pred_1 obj_07 obj_14)
       (pred_1 obj_18 obj_19)
       (pred_1 obj_18 obj_11)
       (pred_1 obj_18 obj_07)
       (pred_1 obj_02 obj_09)
       (pred_1 obj_02 obj_13)
       (pred_1 obj_02 obj_15)
       (pred_1 obj_13 obj_22)
       (pred_1 obj_13 obj_04)
       (pred_1 obj_13 obj_14)
       (pred_1 obj_13 obj_02)
       (pred_1 obj_04 obj_06)
       (pred_1 obj_04 obj_19)
       (pred_1 obj_04 obj_07)
       (pred_1 obj_04 obj_13)
       (pred_1 obj_19 obj_05)
       (pred_1 obj_19 obj_18)
       (pred_1 obj_19 obj_04)
       (pred_1 obj_09 obj_22)
       (pred_1 obj_09 obj_02)
       (pred_1 obj_22 obj_06)
       (pred_1 obj_22 obj_13)
       (pred_1 obj_22 obj_09)
       (pred_1 obj_06 obj_05)
       (pred_1 obj_06 obj_04)
       (pred_1 obj_06 obj_22)
       (pred_1 obj_05 obj_19)
       (pred_1 obj_05 obj_06)
       (pred_10 obj_09)
       (pred_10 obj_14)
       (pred_10 obj_16)
       (pred_3  obj_09 obj_21)
       (pred_3  obj_14 obj_17)
       (pred_3  obj_16 obj_12)
       (pred_9 obj_10)
       (pred_9 obj_08)
       (pred_9 obj_11)
       (pred_9 obj_15)
       (pred_9 obj_07)
       (pred_9 obj_18)
       (pred_9 obj_02)
       (pred_9 obj_13)
       (pred_9 obj_04)
       (pred_9 obj_19)
       (pred_9 obj_22)
       (pred_9 obj_06)
       (pred_9 obj_05)

       (pred_8  obj_20 obj_21)
       (pred_8  obj_01 obj_17)
       (pred_8  obj_03 obj_12)
       (pred_2 obj_20 obj_11)
       (pred_2 obj_01 obj_19)
       (pred_2 obj_03 obj_13)
       (pred_4 obj_18)
    )

    (:goal (and
       (pred_2 obj_20 obj_08)
       (pred_2 obj_01 obj_10)
    ))
(:constraints
  (always (not (pred_4 obj_04)))
)
)

; plan
1. (op_1 obj_18 obj_19)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_19)
   goals met: 0 of 2
2. (op_3 obj_19 obj_01)
   deleted: (pred_2 obj_01 obj_19) (pred_11)
   added: (pred_6 obj_01)
   goals met: 0 of 2
3. (op_1 obj_19 obj_18)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_18)
   goals met: 0 of 2
4. (op_1 obj_18 obj_07)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_07)
   goals met: 0 of 2
5. (op_2 obj_07 obj_14 obj_01 obj_17)
   deleted: (pred_10 obj_14)
   added: (pred_9 obj_14)
   goals met: 0 of 2
6. (op_1 obj_07 obj_18)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_18)
   goals met: 0 of 2
7. (op_1 obj_18 obj_11)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_11)
   goals met: 0 of 2
8. (op_4 obj_11 obj_20 obj_01)
   deleted: (pred_6 obj_01) (pred_2 obj_20 obj_11)
   added: (pred_6 obj_20) (pred_2 obj_01 obj_11)
   goals met: 0 of 2
9. (op_1 obj_11 obj_18)
   deleted: (pred_4 obj_11)
   added: (pred_4 obj_18)
   goals met: 0 of 2
10. (op_1 obj_18 obj_07)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_07)
   goals met: 0 of 2
11. (op_1 obj_07 obj_14)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_14)
   goals met: 0 of 2
12. (op_1 obj_14 obj_08)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_08)
   goals met: 0 of 2
13. (op_5 obj_08 obj_20)
   deleted: (pred_6 obj_20)
   added: (pred_11) (pred_2 obj_20 obj_08)
   goals met: 1 of 2
14. (op_1 obj_08 obj_14)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_14)
   goals met: 1 of 2
15. (op_1 obj_14 obj_07)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_07)
   goals met: 1 of 2
16. (op_1 obj_07 obj_18)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_18)
   goals met: 1 of 2
17. (op_1 obj_18 obj_11)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_11)
   goals met: 1 of 2
18. (op_3 obj_11 obj_01)
   deleted: (pred_2 obj_01 obj_11) (pred_11)
   added: (pred_6 obj_01)
   goals met: 1 of 2
19. (op_1 obj_11 obj_18)
   deleted: (pred_4 obj_11)
   added: (pred_4 obj_18)
   goals met: 1 of 2
20. (op_1 obj_18 obj_07)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_07)
   goals met: 1 of 2
21. (op_1 obj_07 obj_14)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_14)
   goals met: 1 of 2
22. (op_1 obj_14 obj_08)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_08)
   goals met: 1 of 2
23. (op_1 obj_08 obj_10)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_10)
   goals met: 1 of 2
24. (op_5 obj_10 obj_01)
   deleted: (pred_6 obj_01)
   added: (pred_11) (pred_2 obj_01 obj_10)
   goals met: 2 of 2
